lecture-note/ai-lecture-kdh-200908.org
#+title: 머신러닝용 학습용 데이터셋 예제 연습
#+subtitle: 4 weeks by kdh
#+date: <2020-09-08 Tue 18:00>
#+tags: python, bash, elisp, lisp, zoom
#+author: srolisp

* boston prices
 :PROPERTIES:
 :header-args:bash: :results verbatim
 :header-args:elisp: :exports both
 :header-args:ipython: :exports both
 :END:

** sklearn, pandas가 있는지 체크
#+begin_src bash 
pip freeze
#+end_src

#+RESULTS:
#+begin_example
appdirs==1.4.4
appnope==0.1.0
argon2-cffi==20.1.0
astroid==2.4.2
attrs==20.2.0
autopep8==1.5.4
backcall==0.2.0
bleach==3.1.5
cffi==1.14.2
decorator==4.4.2
defusedxml==0.6.0
distlib==0.3.1
entrypoints==0.3
filelock==3.0.12
flake8==3.8.3
importlib-metadata==1.7.0
ipykernel==5.3.4
ipython==7.18.1
ipython-genutils==0.2.0
ipywidgets==7.5.1
isort==5.5.1
jedi==0.17.2
Jinja2==2.11.2
jsonschema==3.2.0
jupyter==1.0.0
jupyter-client==6.1.7
jupyter-console==6.2.0
jupyter-core==4.6.3
lazy-object-proxy==1.4.3
MarkupSafe==1.1.1
mccabe==0.6.1
mistune==0.8.4
nbconvert==5.6.1
nbformat==5.0.7
notebook==6.1.3
numpy==1.19.1
packaging==20.4
pandocfilters==1.4.2
parso==0.7.1
pexpect==4.8.0
pickleshare==0.7.5
pluggy==0.13.1
prometheus-client==0.8.0
prompt-toolkit==3.0.7
ptyprocess==0.6.0
pycodestyle==2.6.0
pycparser==2.20
pydocstyle==5.1.1
pyflakes==2.2.0
Pygments==2.6.1
pylint==2.6.0
pyparsing==2.4.7
pyrsistent==0.16.0
python-dateutil==2.8.1
python-jsonrpc-server==0.3.4
python-language-server==0.34.1
pyzmq==19.0.2
qtconsole==4.7.7
QtPy==1.9.0
rope==0.17.0
Send2Trash==1.5.0
six==1.15.0
snowballstemmer==2.0.0
terminado==0.8.3
testpath==0.4.4
toml==0.10.1
tornado==6.0.4
traitlets==5.0.4
typed-ast==1.4.1
ujson==1.35
virtualenv==20.0.31
wcwidth==0.2.5
webencodings==0.5.1
widgetsnbextension==3.5.1
wrapt==1.12.1
yapf==0.30.0
zipp==3.1.0
#+end_example

#+begin_src bash
pip install -U scikit-learn
#+end_src

#+RESULTS:
#+begin_example
Collecting scikit-learn
  Downloading scikit_learn-0.23.2-cp37-cp37m-macosx_10_9_x86_64.whl (7.2 MB)
Requirement already satisfied, skipping upgrade: numpy>=1.13.3 in /Users/sroh/.pyenv/versions/anaconda3-5.3.1/envs/uiap/lib/python3.7/site-packages (from scikit-learn) (1.19.1)
Collecting threadpoolctl>=2.0.0
  Downloading threadpoolctl-2.1.0-py3-none-any.whl (12 kB)
Collecting scipy>=0.19.1
  Downloading scipy-1.5.2-cp37-cp37m-macosx_10_9_x86_64.whl (28.7 MB)
Collecting joblib>=0.11
  Downloading joblib-0.16.0-py3-none-any.whl (300 kB)
Installing collected packages: threadpoolctl, scipy, joblib, scikit-learn
Successfully installed joblib-0.16.0 scikit-learn-0.23.2 scipy-1.5.2 threadpoolctl-2.1.0
#+end_example

#+begin_src bash
pip install pandas
#+end_src

#+RESULTS:
: Requirement already satisfied: pandas in /Users/sroh/.pyenv/versions/anaconda3-5.3.1/envs/uiap/lib/python3.7/site-packages (1.1.1)
: Requirement already satisfied: pytz>=2017.2 in /Users/sroh/.pyenv/versions/anaconda3-5.3.1/envs/uiap/lib/python3.7/site-packages (from pandas) (2020.1)
: Requirement already satisfied: numpy>=1.15.4 in /Users/sroh/.pyenv/versions/anaconda3-5.3.1/envs/uiap/lib/python3.7/site-packages (from pandas) (1.19.1)
: Requirement already satisfied: python-dateutil>=2.7.3 in /Users/sroh/.pyenv/versions/anaconda3-5.3.1/envs/uiap/lib/python3.7/site-packages (from pandas) (2.8.1)
: Requirement already satisfied: six>=1.5 in /Users/sroh/.pyenv/versions/anaconda3-5.3.1/envs/uiap/lib/python3.7/site-packages (from python-dateutil>=2.7.3->pandas) (1.15.0)

