lecture-note/ai-lecture-kdh-200908.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2020-09-13 Sun 12:56 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>머신러닝용 학습용 데이터셋 예제 연습</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="srolisp" />
</head>
<body>
<div id="content">
<h1 class="title">머신러닝용 학습용 데이터셋 예제 연습
<br />
<span class="subtitle">4 weeks by kdh</span>
</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org899ca56">1. boston prices</a>
<ul>
<li><a href="#org8fe5f50">1.1. sklearn, pandas가 있는지 체크</a></li>
<li><a href="#orgc4be488">1.2. sklearn datasets을 이용한 예제</a></li>
<li><a href="#orgd7de09a">1.3. 유명한 파이썬 개발자들은 X는 대문자를 주로 쓴다. 이 규칙을 따르자.</a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-org899ca56" class="outline-2">
<h2 id="org899ca56"><span class="section-number-2">1</span> boston prices</h2>
<div class="outline-text-2" id="text-1">
</div>

<div id="outline-container-org8fe5f50" class="outline-3">
<h3 id="org8fe5f50"><span class="section-number-3">1.1</span> sklearn, pandas가 있는지 체크</h3>
<div class="outline-text-3" id="text-1-1">
<div class="org-src-container">
<pre class="src src-bash">pip freeze
</pre>
</div>

<div class="org-src-container">
<pre class="src src-bash">pip install -U scikit-learn
</pre>
</div>

<div class="org-src-container">
<pre class="src src-bash">pip install pandas
</pre>
</div>
</div>
</div>
