lecture-note/ai-lecture-kdh-200908.org
** sklearn datasets을 이용한 예제
#+begin_src ipython :session boston :results output :tangle "test.py"
# 사이킷런 데이터셋에서 보스톤주택가격 데이터셋을 임포트한다.
from sklearn.datasets import load_boston
# 데이터프레임을 이용하기 위해 pandas를 임포트한다.
import pandas as pd

# 보스톤 데이터셋을 로드하여 boston에 담는다.

boston = load_boston()
# 보스턴 데이터셋을 출력한다.
print(boston)
#+end_src

#+RESULTS:
#+begin_example
{'data': array([[6.3200e-03, 1.8000e+01, 2.3100e+00, ..., 1.5300e+01, 3.9690e+02,
        4.9800e+00],
       [2.7310e-02, 0.0000e+00, 7.0700e+00, ..., 1.7800e+01, 3.9690e+02,
        9.1400e+00],
       [2.7290e-02, 0.0000e+00, 7.0700e+00, ..., 1.7800e+01, 3.9283e+02,
        4.0300e+00],
       ...,
       [6.0760e-02, 0.0000e+00, 1.1930e+01, ..., 2.1000e+01, 3.9690e+02,
        5.6400e+00],
       [1.0959e-01, 0.0000e+00, 1.1930e+01, ..., 2.1000e+01, 3.9345e+02,
        6.4800e+00],
       [4.7410e-02, 0.0000e+00, 1.1930e+01, ..., 2.1000e+01, 3.9690e+02,
        7.8800e+00]]), 'target': array([24. , 21.6, 34.7, 33.4, 36.2, 28.7, 22.9, 27.1, 16.5, 18.9, 15. ,
       18.9, 21.7, 20.4, 18.2, 19.9, 23.1, 17.5, 20.2, 18.2, 13.6, 19.6,
       15.2, 14.5, 15.6, 13.9, 16.6, 14.8, 18.4, 21. , 12.7, 14.5, 13.2,
       13.1, 13.5, 18.9, 20. , 21. , 24.7, 30.8, 34.9, 26.6, 25.3, 24.7,
       21.2, 19.3, 20. , 16.6, 14.4, 19.4, 19.7, 20.5, 25. , 23.4, 18.9,
       35.4, 24.7, 31.6, 23.3, 19.6, 18.7, 16. , 22.2, 25. , 33. , 23.5,
       19.4, 22. , 17.4, 20.9, 24.2, 21.7, 22.8, 23.4, 24.1, 21.4, 20. ,
       20.8, 21.2, 20.3, 28. , 23.9, 24.8, 22.9, 23.9, 26.6, 22.5, 22.2,
       23.6, 28.7, 22.6, 22. , 22.9, 25. , 20.6, 28.4, 21.4, 38.7, 43.8,
       33.2, 27.5, 26.5, 18.6, 19.3, 20.1, 19.5, 19.5, 20.4, 19.8, 19.4,
       21.7, 22.8, 18.8, 18.7, 18.5, 18.3, 21.2, 19.2, 20.4, 19.3, 22. ,
       20.3, 20.5, 17.3, 18.8, 21.4, 15.7, 16.2, 18. , 14.3, 19.2, 19.6,
       23. , 18.4, 15.6, 18.1, 17.4, 17.1, 13.3, 17.8, 14. , 14.4, 13.4,
       15.6, 11.8, 13.8, 15.6, 14.6, 17.8, 15.4, 21.5, 19.6, 15.3, 19.4,
       17. , 15.6, 13.1, 41.3, 24.3, 23.3, 27. , 50. , 50. , 50. , 22.7,
       25. , 50. , 23.8, 23.8, 22.3, 17.4, 19.1, 23.1, 23.6, 22.6, 29.4,
       23.2, 24.6, 29.9, 37.2, 39.8, 36.2, 37.9, 32.5, 26.4, 29.6, 50. ,
       32. , 29.8, 34.9, 37. , 30.5, 36.4, 31.1, 29.1, 50. , 33.3, 30.3,
       34.6, 34.9, 32.9, 24.1, 42.3, 48.5, 50. , 22.6, 24.4, 22.5, 24.4,
       20. , 21.7, 19.3, 22.4, 28.1, 23.7, 25. , 23.3, 28.7, 21.5, 23. ,
       26.7, 21.7, 27.5, 30.1, 44.8, 50. , 37.6, 31.6, 46.7, 31.5, 24.3,
       31.7, 41.7, 48.3, 29. , 24. , 25.1, 31.5, 23.7, 23.3, 22. , 20.1,
       22.2, 23.7, 17.6, 18.5, 24.3, 20.5, 24.5, 26.2, 24.4, 24.8, 29.6,
       42.8, 21.9, 20.9, 44. , 50. , 36. , 30.1, 33.8, 43.1, 48.8, 31. ,
       36.5, 22.8, 30.7, 50. , 43.5, 20.7, 21.1, 25.2, 24.4, 35.2, 32.4,
       32. , 33.2, 33.1, 29.1, 35.1, 45.4, 35.4, 46. , 50. , 32.2, 22. ,
       20.1, 23.2, 22.3, 24.8, 28.5, 37.3, 27.9, 23.9, 21.7, 28.6, 27.1,
       20.3, 22.5, 29. , 24.8, 22. , 26.4, 33.1, 36.1, 28.4, 33.4, 28.2,
       22.8, 20.3, 16.1, 22.1, 19.4, 21.6, 23.8, 16.2, 17.8, 19.8, 23.1,
       21. , 23.8, 23.1, 20.4, 18.5, 25. , 24.6, 23. , 22.2, 19.3, 22.6,
       19.8, 17.1, 19.4, 22.2, 20.7, 21.1, 19.5, 18.5, 20.6, 19. , 18.7,
       32.7, 16.5, 23.9, 31.2, 17.5, 17.2, 23.1, 24.5, 26.6, 22.9, 24.1,
       18.6, 30.1, 18.2, 20.6, 17.8, 21.7, 22.7, 22.6, 25. , 19.9, 20.8,
       16.8, 21.9, 27.5, 21.9, 23.1, 50. , 50. , 50. , 50. , 50. , 13.8,
       13.8, 15. , 13.9, 13.3, 13.1, 10.2, 10.4, 10.9, 11.3, 12.3,  8.8,
        7.2, 10.5,  7.4, 10.2, 11.5, 15.1, 23.2,  9.7, 13.8, 12.7, 13.1,
       12.5,  8.5,  5. ,  6.3,  5.6,  7.2, 12.1,  8.3,  8.5,  5. , 11.9,
       27.9, 17.2, 27.5, 15. , 17.2, 17.9, 16.3,  7. ,  7.2,  7.5, 10.4,
        8.8,  8.4, 16.7, 14.2, 20.8, 13.4, 11.7,  8.3, 10.2, 10.9, 11. ,
        9.5, 14.5, 14.1, 16.1, 14.3, 11.7, 13.4,  9.6,  8.7,  8.4, 12.8,
       10.5, 17.1, 18.4, 15.4, 10.8, 11.8, 14.9, 12.6, 14.1, 13. , 13.4,
       15.2, 16.1, 17.8, 14.9, 14.1, 12.7, 13.5, 14.9, 20. , 16.4, 17.7,
       19.5, 20.2, 21.4, 19.9, 19. , 19.1, 19.1, 20.1, 19.9, 19.6, 23.2,
       29.8, 13.8, 13.3, 16.7, 12. , 14.6, 21.4, 23. , 23.7, 25. , 21.8,
       20.6, 21.2, 19.1, 20.6, 15.2,  7. ,  8.1, 13.6, 20.1, 21.8, 24.5,
       23.1, 19.7, 18.3, 21.2, 17.5, 16.8, 22.4, 20.6, 23.9, 22. , 11.9]), 'feature_names': array(['CRIM', 'ZN', 'INDUS', 'CHAS', 'NOX', 'RM', 'AGE', 'DIS', 'RAD',
       'TAX', 'PTRATIO', 'B', 'LSTAT'], dtype='<U7'), 'DESCR': ".. _boston_dataset:\n\nBoston house prices dataset\n---------------------------\n\n**Data Set Characteristics:**  \n\n    :Number of Instances: 506 \n\n    :Number of Attributes: 13 numeric/categorical predictive. Median Value (attribute 14) is usually the target.\n\n    :Attribute Information (in order):\n        - CRIM     per capita crime rate by town\n        - ZN       proportion of residential land zoned for lots over 25,000 sq.ft.\n        - INDUS    proportion of non-retail business acres per town\n        - CHAS     Charles River dummy variable (= 1 if tract bounds river; 0 otherwise)\n        - NOX      nitric oxides concentration (parts per 10 million)\n        - RM       average number of rooms per dwelling\n        - AGE      proportion of owner-occupied units built prior to 1940\n        - DIS      weighted distances to five Boston employment centres\n        - RAD      index of accessibility to radial highways\n        - TAX      full-value property-tax rate per $10,000\n        - PTRATIO  pupil-teacher ratio by town\n        - B        1000(Bk - 0.63)^2 where Bk is the proportion of blacks by town\n        - LSTAT    % lower status of the population\n        - MEDV     Median value of owner-occupied homes in $1000's\n\n    :Missing Attribute Values: None\n\n    :Creator: Harrison, D. and Rubinfeld, D.L.\n\nThis is a copy of UCI ML housing dataset.\nhttps://archive.ics.uci.edu/ml/machine-learning-databases/housing/\n\n\nThis dataset was taken from the StatLib library which is maintained at Carnegie Mellon University.\n\nThe Boston house-price data of Harrison, D. and Rubinfeld, D.L. 'Hedonic\nprices and the demand for clean air', J. Environ. Economics & Management,\nvol.5, 81-102, 1978.   Used in Belsley, Kuh & Welsch, 'Regression diagnostics\n...', Wiley, 1980.   N.B. Various transformations are used in the table on\npages 244-261 of the latter.\n\nThe Boston house-price data has been used in many machine learning papers that address regression\nproblems.   \n     \n.. topic:: References\n\n   - Belsley, Kuh & Welsch, 'Regression diagnostics: Identifying Influential Data and Sources of Collinearity', Wiley, 1980. 244-261.\n   - Quinlan,R. (1993). Combining Instance-Based and Model-Based Learning. In Proceedings on the Tenth International Conference of Machine Learning, 236-243, University of Massachusetts, Amherst. Morgan Kaufmann.\n", 'filename': '/Users/sroh/.pyenv/versions/anaconda3-5.3.1/envs/uiap/lib/python3.7/site-packages/sklearn/datasets/data/boston_house_prices.csv'}
#+end_example

#+begin_src ipython :session boston :results output :tangle "test.py"
# 데이터셋의 키값들을 출력한다.
print(boston.keys())
#+end_src

#+RESULTS:
: dict_keys(['data', 'target', 'feature_names', 'DESCR', 'filename'])

#+begin_src ipython :session boston :results output :tangle "test.py"
  # 데이터셋의 설명 내용을 출력한다.
  print(boston.DESCR)
#+end_src

#+RESULTS:
#+begin_example
.. _boston_dataset:

Boston house prices dataset
---------------------------

,**Data Set Characteristics:**  

    :Number of Instances: 506 

    :Number of Attributes: 13 numeric/categorical predictive. Median Value (attribute 14) is usually the target.

    :Attribute Information (in order):
        - CRIM     per capita crime rate by town
        - ZN       proportion of residential land zoned for lots over 25,000 sq.ft.
        - INDUS    proportion of non-retail business acres per town
        - CHAS     Charles River dummy variable (= 1 if tract bounds river; 0 otherwise)
        - NOX      nitric oxides concentration (parts per 10 million)
        - RM       average number of rooms per dwelling
        - AGE      proportion of owner-occupied units built prior to 1940
        - DIS      weighted distances to five Boston employment centres
        - RAD      index of accessibility to radial highways
        - TAX      full-value property-tax rate per $10,000
        - PTRATIO  pupil-teacher ratio by town
        - B        1000(Bk - 0.63)^2 where Bk is the proportion of blacks by town
        - LSTAT    % lower status of the population
        - MEDV     Median value of owner-occupied homes in $1000's

    :Missing Attribute Values: None

    :Creator: Harrison, D. and Rubinfeld, D.L.

This is a copy of UCI ML housing dataset.
https://archive.ics.uci.edu/ml/machine-learning-databases/housing/


This dataset was taken from the StatLib library which is maintained at Carnegie Mellon University.

The Boston house-price data of Harrison, D. and Rubinfeld, D.L. 'Hedonic
prices and the demand for clean air', J. Environ. Economics & Management,
vol.5, 81-102, 1978.   Used in Belsley, Kuh & Welsch, 'Regression diagnostics
...', Wiley, 1980.   N.B. Various transformations are used in the table on
pages 244-261 of the latter.

The Boston house-price data has been used in many machine learning papers that address regression
problems.   
     
.. topic:: References

   - Belsley, Kuh & Welsch, 'Regression diagnostics: Identifying Influential Data and Sources of Collinearity', Wiley, 1980. 244-261.
   - Quinlan,R. (1993). Combining Instance-Based and Model-Based Learning. In Proceedings on the Tenth International Conference of Machine Learning, 236-243, University of Massachusetts, Amherst. Morgan Kaufmann.

#+end_example

#+begin_src ipython :session boston :results output :tangle "test.py"
print(boston.feature_names)
#+end_src

#+RESULTS:
: ['CRIM' 'ZN' 'INDUS' 'CHAS' 'NOX' 'RM' 'AGE' 'DIS' 'RAD' 'TAX' 'PTRATIO'
:  'B' 'LSTAT']

#+begin_src ipython :session boston :results value :tangle "test.py"
# 데이터셋의 데이터값을 특성이름을 이용하여 데이터프레임으로 만든다.
df = pd.DataFrame(boston.data, columns=boston.feature_names)
df
#+end_src

#+RESULTS:
#+begin_example
# Out[17]:
,#+BEGIN_EXAMPLE
  CRIM    ZN  INDUS  CHAS    NOX     RM   AGE     DIS  RAD    TAX  \
  0    0.00632  18.0   2.31   0.0  0.538  6.575  65.2  4.0900  1.0  296.0
  1    0.02731   0.0   7.07   0.0  0.469  6.421  78.9  4.9671  2.0  242.0
  2    0.02729   0.0   7.07   0.0  0.469  7.185  61.1  4.9671  2.0  242.0
  3    0.03237   0.0   2.18   0.0  0.458  6.998  45.8  6.0622  3.0  222.0
  4    0.06905   0.0   2.18   0.0  0.458  7.147  54.2  6.0622  3.0  222.0
  ..       ...   ...    ...   ...    ...    ...   ...     ...  ...    ...
  501  0.06263   0.0  11.93   0.0  0.573  6.593  69.1  2.4786  1.0  273.0
  502  0.04527   0.0  11.93   0.0  0.573  6.120  76.7  2.2875  1.0  273.0
  503  0.06076   0.0  11.93   0.0  0.573  6.976  91.0  2.1675  1.0  273.0
  504  0.10959   0.0  11.93   0.0  0.573  6.794  89.3  2.3889  1.0  273.0
  505  0.04741   0.0  11.93   0.0  0.573  6.030  80.8  2.5050  1.0  273.0
  
  PTRATIO       B  LSTAT
  0       15.3  396.90   4.98
  1       17.8  396.90   9.14
  2       17.8  392.83   4.03
  3       18.7  394.63   2.94
  4       18.7  396.90   5.33
  ..       ...     ...    ...
  501     21.0  391.99   9.67
  502     21.0  396.90   9.08
  503     21.0  396.90   5.64
  504     21.0  393.45   6.48
  505     21.0  396.90   7.88
  
  [506 rows x 13 columns]
,#+END_EXAMPLE
#+end_example

#+begin_src ipython :session boston :results value :tangle "test.py"
# 데이터셋의 타겟값을 데이터프레임에 넣는다.
df['target'] = boston.target
df['target']
#+end_src

#+RESULTS:
#+begin_example
# Out[20]:
,#+BEGIN_EXAMPLE
  0      24.0
  1      21.6
  2      34.7
  3      33.4
  4      36.2
  ...
  501    22.4
  502    20.6
  503    23.9
  504    22.0
  505    11.9
  Name: target, Length: 506, dtype: float64
,#+END_EXAMPLE
#+end_example

#+begin_src ipython :session boston :result output :tangle "test.py"
# 데이터프레임 처음 5개를 출력한다.
df.head()
#+end_src

#+RESULTS:
#+begin_example
# Out[30]:
,#+BEGIN_EXAMPLE
  CRIM    ZN  INDUS  CHAS    NOX     RM   AGE     DIS  RAD    TAX  \
  0  0.00632  18.0   2.31   0.0  0.538  6.575  65.2  4.0900  1.0  296.0
  1  0.02731   0.0   7.07   0.0  0.469  6.421  78.9  4.9671  2.0  242.0
  2  0.02729   0.0   7.07   0.0  0.469  7.185  61.1  4.9671  2.0  242.0
  3  0.03237   0.0   2.18   0.0  0.458  6.998  45.8  6.0622  3.0  222.0
  4  0.06905   0.0   2.18   0.0  0.458  7.147  54.2  6.0622  3.0  222.0
  
  PTRATIO       B  LSTAT  target
  0     15.3  396.90   4.98    24.0
  1     17.8  396.90   9.14    21.6
  2     17.8  392.83   4.03    34.7
  3     18.7  394.63   2.94    33.4
  4     18.7  396.90   5.33    36.2
,#+END_EXAMPLE
#+end_example

#+begin_src ipython :session boston :result output :tangle "test.py"
# 데이터프레임 마지막 5개를 확인한다.
df.tail()
#+end_src

#+RESULTS:
#+begin_example
# Out[29]:
,#+BEGIN_EXAMPLE
  CRIM   ZN  INDUS  CHAS    NOX     RM   AGE     DIS  RAD    TAX  \
  501  0.06263  0.0  11.93   0.0  0.573  6.593  69.1  2.4786  1.0  273.0
  502  0.04527  0.0  11.93   0.0  0.573  6.120  76.7  2.2875  1.0  273.0
  503  0.06076  0.0  11.93   0.0  0.573  6.976  91.0  2.1675  1.0  273.0
  504  0.10959  0.0  11.93   0.0  0.573  6.794  89.3  2.3889  1.0  273.0
  505  0.04741  0.0  11.93   0.0  0.573  6.030  80.8  2.5050  1.0  273.0
  
  PTRATIO       B  LSTAT  target
  501     21.0  391.99   9.67    22.4
  502     21.0  396.90   9.08    20.6
  503     21.0  396.90   5.64    23.9
  504     21.0  393.45   6.48    22.0
  505     21.0  396.90   7.88    11.9
,#+END_EXAMPLE
#+end_example

#+begin_src ipython :session boston :results output :tangle "test.py"
  #데이터프레임의 모양을 출력한다.
  print(df.shape)
  # 데이터프레임의 기본통계 정보를 출력한다.
  print(df.describe())
#+end_src

#+RESULTS:
#+begin_example
(506, 14)
             CRIM          ZN       INDUS        CHAS         NOX          RM  \
count  506.000000  506.000000  506.000000  506.000000  506.000000  506.000000   
mean     3.613524   11.363636   11.136779    0.069170    0.554695    6.284634   
std      8.601545   23.322453    6.860353    0.253994    0.115878    0.702617   
min      0.006320    0.000000    0.460000    0.000000    0.385000    3.561000   
25%      0.082045    0.000000    5.190000    0.000000    0.449000    5.885500   
50%      0.256510    0.000000    9.690000    0.000000    0.538000    6.208500   
75%      3.677083   12.500000   18.100000    0.000000    0.624000    6.623500   
max     88.976200  100.000000   27.740000    1.000000    0.871000    8.780000   

              AGE         DIS         RAD         TAX     PTRATIO           B  \
count  506.000000  506.000000  506.000000  506.000000  506.000000  506.000000   
mean    68.574901    3.795043    9.549407  408.237154   18.455534  356.674032   
std     28.148861    2.105710    8.707259  168.537116    2.164946   91.294864   
min      2.900000    1.129600    1.000000  187.000000   12.600000    0.320000   
25%     45.025000    2.100175    4.000000  279.000000   17.400000  375.377500   
50%     77.500000    3.207450    5.000000  330.000000   19.050000  391.440000   
75%     94.075000    5.188425   24.000000  666.000000   20.200000  396.225000   
max    100.000000   12.126500   24.000000  711.000000   22.000000  396.900000   

            LSTAT      target  
count  506.000000  506.000000  
mean    12.653063   22.532806  
std      7.141062    9.197104  
min      1.730000    5.000000  
25%      6.950000   17.025000  
50%     11.360000   21.200000  
75%     16.955000   25.000000  
max     37.970000   50.000000  
#+end_example

#+begin_src ipython :session boston :results output :tangle "test.py"
  # 데이터프레임의 마지막 컬럼값을 카운트하여 출력한다.
  print(df.iloc[:, -1].value_counts())
#+end_src  

#+RESULTS:
#+begin_example
50.0    16
25.0     8
23.1     7
21.7     7
22.0     7
        ..
12.8     1
29.9     1
9.6      1
36.1     1
13.0     1
Name: target, Length: 229, dtype: int64
#+end_example

